MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA8T1AHECFC/mcu.h
        struct
        {
            __IOM uint32_t ULPTCNT : 32; /*!< [31..0] 32bit counter and reload registerNOTE : When 1 is written
                                          *   to the TSTOP bit in the ULPTCR register, the 32-bit counter
                                          *   is forcibly stopped and set to FFFFFFFFH.                                 */
        } ULPTCNT_b;
    };

    union
    {
        __IOM uint32_t ULPTCMA;          /*!< (@ 0x00000004) ULPT Compare Match A Register                              */

        struct
        {
            __IOM uint32_t ULPTCMA : 32; /*!< [31..0] ULPT Compare Match A RegisterNOTE : When 1 is written
                                          *   to the TSTOP bit in the ULPTCR register, set to FFFFFFFFH                 */
        } ULPTCMA_b;
    };

    union
    {
        __IOM uint32_t ULPTCMB;          /*!< (@ 0x00000008) ULPT Compare Match B Register                              */

        struct
        {
            __IOM uint32_t ULPTCMB : 32; /*!< [31..0] AGT Compare Match B RegisterNOTE : When 1 is written
                                          *   to the TSTOP bit in the ULPTCR register, set to FFFFFFFFH                 */
        } ULPTCMB_b;
    };

    union
    {
        __IOM uint8_t ULPTCR;          /*!< (@ 0x0000000C) ULPT Control Register                                      */

        struct
        {
            __IOM uint8_t TSTART : 1;  /*!< [0..0] ULPT count start                                                   */
            __IM uint8_t  TCSTF  : 1;  /*!< [1..1] ULPT count status flag                                             */
            __OM uint8_t  TSTOP  : 1;  /*!< [2..2] ULPT count forced stop                                             */
            uint8_t              : 2;
            __IOM uint8_t TUNDF  : 1;  /*!< [5..5] ULPT underflow flag                                                */
            __IOM uint8_t TCMAF  : 1;  /*!< [6..6] ULPT compare match A flag                                          */
            __IOM uint8_t TCMBF  : 1;  /*!< [7..7] ULPT compare match B flag                                          */
        } ULPTCR_b;
    };

    union
    {
        __IOM uint8_t ULPTMR1;         /*!< (@ 0x0000000D) ULPT Mode Register 1                                       */

        struct
        {
            uint8_t              : 1;
            __IOM uint8_t TMOD1  : 1;  /*!< [1..1] ULPT operating mode select                                         */
            uint8_t              : 1;
            __IOM uint8_t TEDGPL : 1;  /*!< [3..3] ULPTEVI edge polarity select                                       */
            uint8_t              : 1;
            __IOM uint8_t TCK1   : 1;  /*!< [5..5] ULPT count source select                                           */
            uint8_t              : 2;
        } ULPTMR1_b;
    };

    union
    {
        __IOM uint8_t ULPTMR2;         /*!< (@ 0x0000000E) ULPT Mode Register 2                                       */

        struct
        {
            __IOM uint8_t CKS : 3;     /*!< [2..0] fsub/LOCO count source clock frequency division ratio
                                        *   select                                                                    */
            uint8_t           : 4;
            __IOM uint8_t LPM : 1;     /*!< [7..7] ULPT Low Power Mode                                                */
        } ULPTMR2_b;
    };

    union
    {
        __IOM uint8_t ULPTMR3;         /*!< (@ 0x0000000F) ULPT Mode Register 3                                       */

        struct
        {
            __IOM uint8_t TCNTCTL : 1; /*!< [0..0] ULPT count function select                                         */
            __IOM uint8_t TEVPOL  : 1; /*!< [1..1] ULPTEVI polarity switch                                            */
            __IOM uint8_t TOPOL   : 1; /*!< [2..2] ULPTO polarity select                                              */
            uint8_t               : 1;
            __IOM uint8_t TEECTL  : 2; /*!< [5..4] ULPTEE function select                                             */
            __IOM uint8_t TEEPOL  : 2; /*!< [7..6] ULPTEE edge polarity select                                        */
        } ULPTMR3_b;
    };

    union
    {
        __IOM uint8_t ULPTIOC;         /*!< (@ 0x00000010) ULPT I/O Control Register                                  */

        struct
        {
            uint8_t              : 2;
            __IOM uint8_t TOE    : 1;  /*!< [2..2] ULPTO output enable                                                */
            uint8_t              : 1;
            __IOM uint8_t TIPF   : 2;  /*!< [5..4] ULPTEVI input filter select                                        */
            __IOM uint8_t TIOGT0 : 1;  /*!< [6..6] ULPTEVI count control                                              */
            uint8_t              : 1;
        } ULPTIOC_b;
    };

    union
    {
        __IOM uint8_t ULPTISR;         /*!< (@ 0x00000011) ULPT Event Pin Select Register                             */

        struct
        {
            uint8_t                : 2;
            __IOM uint8_t RCCPSEL2 : 1; /*!< [2..2] ULPTEE polarty selection                                           */
            uint8_t                : 5;
        } ULPTISR_b;
    };

    union
    {
        __IOM uint8_t ULPTCMSR;        /*!< (@ 0x00000012) ULPT Compare Match Function Select Register                */

        struct
        {
            __IOM uint8_t TCMEA  : 1;  /*!< [0..0] Compare match A register enable                                    */
            __IOM uint8_t TOEA   : 1;  /*!< [1..1] ULPTOA output enable                                               */
            __IOM uint8_t TOPOLA : 1;  /*!< [2..2] ULPTOA polarity select                                             */
            uint8_t              : 1;
            __IOM uint8_t TCMEB  : 1;  /*!< [4..4] Compare match B register enable                                    */
            __IOM uint8_t TOEB   : 1;  /*!< [5..5] ULPTOB output enable                                               */
            __IOM uint8_t TOPOLB : 1;  /*!< [6..6] ULPTOB polarity select                                             */
            uint8_t              : 1;
        } ULPTCMSR_b;
    };
    __IM uint8_t RESERVED;
} R_ULPT0_Type;                        /*!< Size = 20 (0x14)                                                          */

/* =========================================================================================================================== */
/* ================                                        R_DEBUG_OCD                                        ================ */
/* =========================================================================================================================== */

/**
 * @brief On-Chip Debug Function (R_DEBUG_OCD)
 */

typedef struct                         /*!< (@ 0x40011000) R_DEBUG_OCD Structure                                      */
{
    __IM uint32_t RESERVED[192];

    union
    {
        __IM uint32_t FSBLSTATM;       /*!< (@ 0x00000300) First Stage Boot Loader Status Monitor Register            */

        struct
        {
            __IM uint32_t CS : 1;      /*!< [0..0] FSBL completion status.                                            */
            __IM uint32_t RS : 1;      /*!< [1..1] FSBL result status.                                                */
            uint32_t         : 30;
        } FSBLSTATM_b;
    };
} R_DEBUG_OCD_Type;                    /*!< Size = 772 (0x304)                                                        */

/* =========================================================================================================================== */
/* ================                                          R_AGTX0                                          ================ */
/* =========================================================================================================================== */

/**
 * @brief Asynchronous General Purpose Timer (R_AGTX0)
 */

typedef struct                          /*!< (@ 0x40221000) R_AGTX0 Structure                                          */
{
    union
    {
        __IOM R_AGTX0_AGT32_Type AGT32; /*!< (@ 0x00000000) AGTW (32-bit) peripheral registers                         */
        __IOM R_AGTX0_AGT16_Type AGT16; /*!< (@ 0x00000000) AGT (16-bit) peripheral registers                          */
    };
} R_AGTX0_Type;                         /*!< Size = 20 (0x14)                                                          */

/* =========================================================================================================================== */
/* ================                                         R_ECCMB0                                          ================ */
/* =========================================================================================================================== */

/**
 * @brief CANFD ECC (R_ECCMB0)
 */

typedef struct                          /*!< (@ 0x4036F200) R_ECCMB0 Structure                                         */
{
    union
    {
        __IOM uint32_t EC710CTL;        /*!< (@ 0x00000000) ECC Control Register                                       */

        struct
        {
            __IM uint32_t  ECEMF   : 1; /*!< [0..0] ECC Error Message Flag                                             */
            __IM uint32_t  ECER1F  : 1; /*!< [1..1] ECC Error Detection and Correction Flag                            */
            __IM uint32_t  ECER2F  : 1; /*!< [2..2] 2-bit ECC Error Detection Flag                                     */
            __IOM uint32_t EC1EDIC : 1; /*!< [3..3] ECC 1-bit Error Detection Interrupt Control                        */
            __IOM uint32_t EC2EDIC : 1; /*!< [4..4] ECC 2-bit Error Detection Interrupt Control                        */
            __IOM uint32_t EC1ECP  : 1; /*!< [5..5] ECC 1-bit Error Correction Permission                              */
            __IOM uint32_t ECERVF  : 1; /*!< [6..6] ECC Error Judgment Enable Flag                                     */
            uint32_t               : 2;
            __IOM uint32_t ECER1C  : 1; /*!< [9..9] Accumulating ECC Error Detection and Correction Flag
                                         *   Clear                                                                     */
            __IOM uint32_t ECER2C  : 1; /*!< [10..10] 2-bit ECC Error Detection Flag Clear                             */
            __IM uint32_t  ECOVFF  : 1; /*!< [11..11] ECC Overflow Detection Flag                                      */
            uint32_t               : 2;
            __IOM uint32_t EMCA    : 2; /*!< [15..14] Access Control to ECC Mode Select bit                            */
            __IM uint32_t  ECSEDF0 : 1; /*!< [16..16] ECC Single bit Error Address Detection Flag                      */
            __IM uint32_t  ECDEDF0 : 1; /*!< [17..17] ECC Dual Bit Error Address Detection Flag                        */
            uint32_t               : 14;
        } EC710CTL_b;
    };

    union
    {
        __IOM uint16_t EC710TMC;       /*!< (@ 0x00000004) ECC Test Mode Control Register                             */

        struct
        {
            uint16_t              : 1;
            __IOM uint16_t ECDCS  : 1; /*!< [1..1] ECC Decode Input Select                                            */
            uint16_t              : 5;
            __IOM uint16_t ECTMCE : 1; /*!< [7..7] ECC Test Mode Control Enable                                       */
            uint16_t              : 6;
            __IOM uint16_t ETMA   : 2; /*!< [15..14] ECC Test Mode Bit Access Control                                 */
        } EC710TMC_b;
    };
    __IM uint16_t RESERVED;
    __IM uint32_t RESERVED1;

    union
    {
        __IOM uint32_t EC710TED;       /*!< (@ 0x0000000C) ECC Test Substitute Data Register                          */

        struct
        {
            __IOM uint32_t ECEDB : 32; /*!< [31..0] ECC Test Substitute Data                                          */
        } EC710TED_b;
    };

    union
    {
        __IM uint32_t EC710EAD0;       /*!< (@ 0x00000010) ECC Error Address Register                                 */

        struct
        {
            __IM uint32_t ECEAD : 10;  /*!< [9..0] ECC Error Address                                                  */
            uint32_t            : 22;
        } EC710EAD0_b;
    };
} R_ECCMB0_Type;                       /*!< Size = 20 (0x14)                                                          */

/* =========================================================================================================================== */
/* ================                                          R_FLAD                                           ================ */
/* =========================================================================================================================== */

/**
 * @brief Data Flash (R_FLAD)
 */

typedef struct                         /*!< (@ 0x4011C000) R_FLAD Structure                                           */
{
    __IM uint8_t RESERVED[64];

    union
    {
        __IOM uint8_t FCKMHZ;          /*!< (@ 0x00000040) Data Flash Access Frequency Register                       */

        struct
        {
            __IOM uint8_t FCKMHZ : 8;  /*!< [7..0] Data Flash Access Frequency Register                               */
        } FCKMHZ_b;
    };
} R_FLAD_Type;                         /*!< Size = 65 (0x41)                                                          */

/* =========================================================================================================================== */
/* ================                                      R_OFS_DATAFLASH                                      ================ */
/* =========================================================================================================================== */

/**
 * @brief Data Flash Option-Setting Memory (R_OFS_DATAFLASH)
 */

typedef struct                         /*!< (@ 0x27030000) R_OFS_DATAFLASH Structure                                  */
{
    __IM uint32_t RESERVED[32];

    union
    {
        __IM uint32_t FSBLCTRL0;          /*!< (@ 0x00000080) FSBL Control Register 0                                    */

        struct
        {
            __IM uint32_t FSBLEN     : 3; /*!< [2..0] FSBL Enable                                                        */
            __IM uint32_t FSBLSKIPSW : 3; /*!< [5..3] FSBL Skip Enable for Software Reset                                */
            __IM uint32_t FSBLSKIPDS : 3; /*!< [8..6] FSBL Skip Enable for Deep Software Standby Reset                   */
            __IM uint32_t FSBLCLK    : 3; /*!< [11..9] Clock Frequency Selection during FSBL Execution                   */
            uint32_t                 : 20;
        } FSBLCTRL0_b;
    };

    union
    {
        __IM uint32_t FSBLCTRL1;        /*!< (@ 0x00000084) FSBL Control Register 1                                    */

        struct
        {
            __IM uint32_t FSBLEXMD : 2; /*!< [1..0] FSBL Execution Mode                                                */
            uint32_t               : 30;
        } FSBLCTRL1_b;
    };

    union
    {
        __IM uint32_t FSBLCTRL2;                  /*!< (@ 0x00000088) FSBL Control Register 2                                    */

        struct
        {
            __IM uint32_t PORTPN : 4;             /*!< [3..0] FSBL Error Notification Port Pin Number                            */
            __IM uint32_t PORTGN : 5;             /*!< [8..4] FSBL Error Notification Port Group Name                            */
            uint32_t             : 23;
        } FSBLCTRL2_b;
    };
    __IOM uint32_t SACC0;                         /*!< (@ 0x0000008C) Start Address of Code Certification 0                      */
    __IOM uint32_t SACC1;                         /*!< (@ 0x00000090) Start Address of Code Certification 1                      */
    __IOM uint32_t SAMR;                          /*!< (@ 0x00000094) Start Address of Measurement Report                        */
    __IM uint32_t  RESERVED1[178];
    __IM uint32_t  HOEMRTPK;                      /*!< (@ 0x00000360) Hask of OEM_ROOT_PK                                        */
    __IM uint32_t  RESERVED2[7];
    __IOM R_OFS_DATAFLASH_CFGDLOCK_Type CFGDLOCK; /*!< (@ 0x00000380) Configuration Data Lock Bits                               */
    __IM uint32_t RESERVED3[11];

    union
    {
        __IOM uint16_t ARCLS;            /*!< (@ 0x000003C0) Anti-Rollback Counter Lock Setting                         */

        struct
        {
            __IOM uint16_t ARCS_LK  : 1; /*!< [0..0] ARC_SEC Lock                                                       */
            __IOM uint16_t ARCNS_LK : 4; /*!< [4..1] ARC_NSEC Lock                                                      */
            __IOM uint16_t ARCBL_LK : 1; /*!< [5..5] ARC_OEMBL Lock                                                     */
            uint16_t                : 10;
        } ARCLS_b;
    };

    union
    {
        __IOM uint16_t ARCCS;             /*!< (@ 0x000003C2) ARCCS                                                      */

        struct
        {
            __IOM uint16_t CNF_ARCNS : 2; /*!< [1..0] Configuation setting for ARC_NSEC                                  */
            uint16_t                 : 14;
        } ARCCS_b;
    };
    __IM uint32_t RESERVED4[291];

    union
    {
        __IOM uint32_t ARC_SEC[2];       /*!< (@ 0x00000850) Anti-Rollback Counter for Secure Application
                                          *                  n                                                          */

        struct
        {
            __IOM uint32_t ARC_SEC : 32; /*!< [31..0] ARC_SEC                                                           */
        } ARC_SEC_b[2];
    };

    union
    {
        __IOM uint32_t ARC_NSEC[8];       /*!< (@ 0x00000858) Anti-Rollback Counter for Non-Secure Application           */

        struct
        {
            __IOM uint32_t ARC_NSEC : 32; /*!< [31..0] Anti-Rollback Counter for Non-secure Application                  */
        } ARC_NSEC_b[8];
    };

    union
    {
        __IOM uint32_t ARC_OEMBL[2];       /*!< (@ 0x00000878) Anti-Rollback Counter for OEMBL                            */

        struct
        {
            __IOM uint32_t ARC_OEMBL : 32; /*!< [31..0] Anti-Rollback Counter for OEM_BL Application                      */
        } ARC_OEMBL_b[2];
    };
} R_OFS_DATAFLASH_Type;                    /*!< Size = 2176 (0x880)                                                       */

